app/controllers/chapters_controller.rb

SELECT "stories".* FROM "stories" WHERE "stories"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "chapters".* FROM "chapters"
---
  def index
    @story = Story.find params[:story_id]

      @chapters = Chapter.all

SELECT "chapters".* FROM "chapters" WHERE "chapters"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @chapter = Chapter.find(params[:id])

SELECT "stories".* FROM "stories" WHERE "stories"."id" = ? LIMIT 1  [["id", "1"]]
---
  def new
    @story = Story.find params[:story_id]

SELECT "chapters".* FROM "chapters" WHERE "chapters"."id" = ? LIMIT 1  [["id", "8"]]
SELECT "stories".* FROM "stories" WHERE "stories"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @chapter = Chapter.find(params[:id])
    @story = Story.find params[:story_id]

SELECT "stories".* FROM "stories" WHERE "stories"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "chapters" ("created_at", "created_by", "creation_date", "image", "main_chapter", "story_id", "subtitle", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @story = Story.find params[:story_id]
    @chapter = Chapter.new(params[:chapter])
    @chapter.story = @story
    @chapter.user = current_user
    respond_to do |format|
      if @chapter.save