app/controllers/stories_controller.rb

SELECT "stories".* FROM "stories"
---
  def index
    @stories = Story.all

SELECT "stories".* FROM "stories" WHERE "stories"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @story = Story.find(params[:id])

SELECT "stories".* FROM "stories" WHERE "stories"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @story = Story.find(params[:id])

INSERT INTO "stories" ("created_at", "created_by", "creation_date", "genre", "intro", "main_story", "number_of_writers", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @story = Story.new(params[:story])
    @story.user = current_user
    respond_to do |format|
      if @story.save

SELECT "stories".* FROM "stories" WHERE "stories"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "stories" SET "title" = 'new storyyyyyy', "updated_at" = '2012-11-08 14:46:23.405805' WHERE "stories"."id" = 1
---
  def update
    @story = Story.find(params[:id])

    respond_to do |format|
      if @story.update_attributes(params[:story])

SELECT "stories".* FROM "stories" WHERE "stories"."id" = ? LIMIT 1  [["id", "1"]]
---
  def chapter
   Story.find(params[:id]).chapter.create(params[:chapter])